1c/configuration/InformationRegisters/ТУРВ_НастройкиСервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТУРВ_НастройкиСервиса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УровеньЛогирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛогинПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПарольПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1c/configuration/InformationRegisters/ТУРВ_НастройкиСервиса/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция НастройкиСервиса() Экспорт 
	
	СтруктураВозврата = ТУРВ_РаботаСФункциямиКлиентСервер.СтруктураВозврата();
	СтруктураРезультата = Новый Структура("АдресСервера, ЛогинПользователя, ПарольПользователя, ИДБазы, УровеньЛогирования");
	
	ВыборкаЗаписей = РегистрыСведений.ТУРВ_НастройкиСервиса.Выбрать();
	Если ВыборкаЗаписей.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураРезультата, ВыборкаЗаписей);
		//ToDo Убрать
		СтруктураРезультата.ИДБазы = 0;
	Иначе 
		ТУРВ_РаботаСФункциямиКлиентСервер.ДобавитьОшибку(СтруктураВозврата, "Не найдены настройки сервиса");
	КонецЕсли;	
	
	ТУРВ_РаботаСФункциямиКлиентСервер.ДобавитьРезультат(СтруктураВозврата, СтруктураРезультата);
	
	Возврат СтруктураВозврата;
	
КонецФункции	

#КонецОбласти
